import numpy as np
import pandas as pd

#1
df = pd.read_excel('ООО_Внимание_к_деталям (2) (1).xlsx')

d1 = df.loc[(df["Формат магазина"] == "Стрит") & (df['Выборка'] == 'Тестовая')]
d2 = df.loc[(df["Формат магазина"] == "Strееt") & (df['Выборка'] == 'Тестовая')]
d3 = df.loc[(df["Формат магазина"] == "Street") & (df['Выборка'] == 'Тестовая')]
d4 = df.loc[(df["Формат магазина"] == "Стрт") & (df['Выборка'] == 'Тестовая')]
df_result = d1['Формат магазина'].count() + d2['Формат магазина'].count() + d3['Формат магазина'].count() + d4['Формат магазина'].count()

print('Магазинов стрит: ', df_result)


#2







#3
parking = df.loc[df['Парковка'] == 'бесплатная парковка']
parking2 = df.loc[df['Парковка'] == 'бесплaтная паркoвка']
free_parking = parking['Парковка'].count() + parking2['Парковка'].count()

print('Магазин бесплатная парковка: ', free_parking)




